IRP/src/AccumulationRegisters/R2050T_RetailSales/R2050T_RetailSales.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
 <name>R2050T_RetailSales</name>
 <registerType>Turnovers</registerType>
 <resources>
  <name>Quantity</name>
  <type>
   <types>DefinedType.typeQuantity</types>
  </type>
 </resources>
 <resources>
  <name>Amount</name>
  <type>
   <types>DefinedType.typeAmount</types>
  </type>
 </resources>
 <resources>
  <name>NetAmount</name>
  <type>
   <types>DefinedType.typeAmount</types>
  </type>
 </resources>
 <resources>
  <name>OffersAmount</name>
  <type>
   <types>DefinedType.typeAmount</types>
  </type>
 </resources>
 <dimensions>
  <name>Company</name>
  <type>
   <types>CatalogRef.Companies</types>
  </type>
 </dimensions>
 <dimensions>
  <name>Branch</name>
  <type>
   <types>CatalogRef.BusinessUnits</types>
  </type>
 </dimensions>
 <dimensions>
  <name>Store</name>
  <type>
   <types>CatalogRef.Stores</types>
  </type>
 </dimensions>
 <dimensions>
  <name>SalesPerson</name>
  <type>
   <types>CatalogRef.Partners</types>
  </type>
 </dimensions>
 <dimensions>
  <name>RetailSalesReceipt</name>
  <type>
   <types>DocumentRef.RetailReturnReceipt</types>
   <types>DocumentRef.RetailSalesReceipt</types>
  </type>
 </dimensions>
 <dimensions>
  <name>ItemKey</name>
  <type>
   <types>CatalogRef.ItemKeys</types>
  </type>
 </dimensions>
 <dimensions>
  <name>SerialLotNumber</name>
  <type>
   <types>CatalogRef.SerialLotNumbers</types>
  </type>
 </dimensions>
 <dimensions>
  <name>RowKey</name>
  <type>
   <types>DefinedType.typeRowID</types>
  </type>
 </dimensions>
</mdclass:AccumulationRegister>

IRP/src/InformationRegisters/DocumentFiscalStatus/DocumentFiscalStatus.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
 <name>DocumentFiscalStatus</name>
 <resources>
  <name>Status</name>
  <type>
   <types>EnumRef.DocumentFiscalStatuses</types>
  </type>
 </resources>
 <resources>
  <name>Device</name>
  <type>
   <types>CatalogRef.Hardware</types>
  </type>
 </resources>
 <resources>
  <name>DeviceNumber</name>
  <type>
   <types>String</types>
   <stringQualifiers>
    <length>50</length>
   </stringQualifiers>
  </type>
 </resources>
 <resources>
  <name>ShiftNumber</name>
  <type>
   <types>String</types>
   <stringQualifiers>
    <length>50</length>
   </stringQualifiers>
  </type>
 </resources>
 <resources>
  <name>CheckNumber</name>
  <type>
   <types>String</types>
   <stringQualifiers>
    <length>50</length>
   </stringQualifiers>
  </type>
 </resources>
 <resources>
  <name>CheckDate</name>
  <type>
   <types>Date</types>
  </type>
 </resources>
 <attributes>
  <name>FiscalResponse</name>
  <type>
   <types>String</types>
  </type>
 </attributes>
 <attributes>
  <name>DataPresentation</name>
  <type>
   <types>String</types>
   <stringQualifiers>
    <length>128</length>
   </stringQualifiers>
  </type>
 </attributes>
 <dimensions>
  <name>Document</name>
  <type>
   <types>DocumentRef.CashPayment</types>
   <types>DocumentRef.BankReceipt</types>
   <types>DocumentRef.BankPayment</types>
   <types>DocumentRef.CashReceipt</types>
   <types>DocumentRef.RetailReturnReceipt</types>
   <types>DocumentRef.MoneyTransfer</types>
   <types>DocumentRef.RetailSalesReceipt</types>
   <types>DocumentRef.RetailReceiptCorrection</types>
  </type>
 </dimensions>
</mdclass:InformationRegister>

IRP/src/CommonForms/SelectionRetailBasisForReturn/Module.bsl
&AtServer
Procedure OnCreateAtServer(Cancel, StandardProcessing)
	
	ThisObject.RetailCustomer = Parameters.RetailCustomer;
	ThisObject.ItemKey = Parameters.ItemKey;
	
	SetListParameters();

EndProcedure

&AtClient
Procedure Choose(Command)
	CurrentData = Items.List.CurrentData;
	If CurrentData = Undefined Then
		Return;
	EndIf;
	Close(CurrentData.RetailSalesReceipt);
EndProcedure

&AtClient
Procedure ListSelection(Item, RowSelected, Field, StandardProcessing)
	StandardProcessing = False;
	Choose(Undefined);
EndProcedure

&AtClient
Procedure RetailCustomerOnChange(Item)
	SetListParameters();
	Items.List.Refresh();
EndProcedure

&AtClient
Procedure ItemKeyOnChange(Item)
	SetListParameters();
	Items.List.Refresh();
EndProcedure

&AtClient
Procedure FiscalNumberOnChange(Item)
	SetListParameters();
	Items.List.Refresh();
EndProcedure

&AtServer
Procedure SetListParameters()
	
	ThisObject.List.QueryText = 
	"SELECT
	|	R2050T_RetailSalesTurnovers.RetailSalesReceipt,
	|	SalesTable.Date AS SaleDate,
	|	SalesTable.RetailCustomer AS RetailCustomer,
	|	MAX(ISNULL(DocumentFiscalStatus.DataPresentation, """")) AS FiscalData,
	|	SalesTable.DocumentAmount
	|INTO tmpData
	|FROM
	|	AccumulationRegister.R2050T_RetailSales.Turnovers AS R2050T_RetailSalesTurnovers
	|		LEFT JOIN Document.RetailSalesReceipt AS SalesTable
	|		ON R2050T_RetailSalesTurnovers.RetailSalesReceipt = SalesTable.Ref
	|		LEFT JOIN InformationRegister.DocumentFiscalStatus AS DocumentFiscalStatus
	|		ON R2050T_RetailSalesTurnovers.RetailSalesReceipt = DocumentFiscalStatus.Document
	|
	|" + ?(ThisObject.ItemKey.IsEmpty(), "", "WHERE R2050T_RetailSalesTurnovers.ItemKey = &ItemKey") + "
	|GROUP BY
	|	R2050T_RetailSalesTurnovers.RetailSalesReceipt,
	|	SalesTable.Date,
	|	SalesTable.RetailCustomer,
	|	SalesTable.DocumentAmount
	|HAVING
	|	SUM(R2050T_RetailSalesTurnovers.QuantityTurnover) > 0
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|SELECT
	|	tmpData.RetailSalesReceipt,
	|	tmpData.SaleDate,
	|	tmpData.RetailCustomer,
	|	tmpData.FiscalData,
	|	tmpData.DocumentAmount
	|FROM
	|	tmpData AS tmpData
	|WHERE
	|	TRUE
	|	" + ?(ThisObject.RetailCustomer.IsEmpty(), "", "AND tmpData.RetailCustomer = &RetailCustomer") + "
	|	" + ?(IsBlankString(ThisObject.FiscalNumber), "", "AND tmpData.FiscalData LIKE &FiscalNumber");
	
	If Not ThisObject.ItemKey.IsEmpty() Then
		ThisObject.List.Parameters.SetParameterValue("ItemKey", ThisObject.ItemKey);
	EndIf;
	
	If Not ThisObject.RetailCustomer.IsEmpty() Then
		ThisObject.List.Parameters.SetParameterValue("RetailCustomer", ThisObject.RetailCustomer);
	EndIf;
	
	If Not IsBlankString(ThisObject.FiscalNumber) Then
		ThisObject.List.Parameters.SetParameterValue("FiscalNumber", "%" + TrimAll(ThisObject.FiscalNumber) + "%");
	EndIf;
	
EndProcedure
